devdnl/dnx-rtos/src/system/drivers/i2c/stm32f1/i2c.c
                printk("Timout %d\n", last_state); // TEST

                return false;
        }

        if (I2C->periph[hdl->config->major].error) {
                printk("Error %d\n", last_state); // TEST

                errno = EIO;
                return false;
        }

        return true;
}

//==============================================================================
/**
 * @brief  Configure IRQ's state machine to perform data transmission
 * @param  hdl                  device's handle
 * @param  sub_addr_mode        sub-address send enabled (details read from configuration)
 * @param  sub_addr             sub-address value
 * @param  src                  data source
 * @param  size                 size of data
 * @param  stop                 send STOP sequence after transaction (true)
 * @return On success returns number of transfered bytes, otherwise -1 and
 *         appropriate error is set
 */
//==============================================================================
static ssize_t I2C_transmit(I2C_dev_t *hdl, bool sub_addr_mode, u32_t sub_addr, const u8_t *src, size_t size, bool stop)
{
        printk("transmit\n"); // TEST

        struct I2C_per *per = &I2C->periph[hdl->config->major];

        per->data          = const_cast(u8_t*, src);
        per->data_size     = size;
        per->stop          = stop;
        per->write         = true;
        per->sub_addr      = sub_addr;
        per->sub_addr_mode = sub_addr_mode ? hdl->config->sub_addr_mode : I2C_SUB_ADDR_MODE__DISABLED;
        per->dev           = hdl;
        per->state         = STATE_START;

        SET_BIT(get_I2C(hdl)->CR1, I2C_CR1_START);

        return wait_for_event(hdl) ? static_cast(ssize_t, size - per->data_size) : -1;
}

//==============================================================================
/**
 * @brief  Configre IRQ's state machine to perform data reception
 * @param  hdl                  device's handle
 * @param  dst                  data destination buffer
 * @param  size                 number of bytes to read
 * @param  stop                 send STOP sequence after transaction (true)
 * @param  On success returns number of received bytes, otherwise -1 and
 *         appropriate error is set
 */
//==============================================================================
static ssize_t I2C_receive(I2C_dev_t *hdl, u8_t *dst, size_t size, bool stop)
{
        printk("receive\n"); // TEST

        struct I2C_per *per = &I2C->periph[hdl->config->major];

        per->data          = dst;
        per->data_size     = size;
        per->stop          = stop;
        per->write         = false;
        per->sub_addr      = 0;
        per->sub_addr_mode = I2C_SUB_ADDR_MODE__DISABLED;
        per->dev           = hdl;
        per->state         = STATE_START;

        SET_BIT(get_I2C(hdl)->CR1, I2C_CR1_START);

        return wait_for_event(hdl) ? static_cast(ssize_t, size - per->data_size) : -1;
}

//==============================================================================
/**
 * @brief  Event IRQ handler (transaction state machine)
 * @param  major        number of peripheral
 * @return If IRQ was woken then true is returned, otherwise false
 */
//==============================================================================
static bool IRQ_EV_handler(u8_t major)
{
        GPIO_SET_PIN(TP223); // TEST

        I2C_t          *i2c   = const_cast(I2C_t*, I2C_cfg[major].I2C);
        struct I2C_per *per   = &I2C->periph[major];
        bool            woken = false;


        void error()
        {
                last_state = per->state; //TEST
                woken = IRQ_ER_handler(major);
        }

        void finish()
        {
                per->addr10rd = false;
                per->state    = STATE_IDLE;
                CLEAR_BIT(i2c->CR2, I2C_CR2_ITEVTEN | I2C_CR2_ITERREN | I2C_CR2_ITBUFEN);

                if (per->stop)
                        SET_BIT(i2c->CR1, I2C_CR1_STOP);

                semaphore_signal_from_ISR(I2C->periph[major].event, &woken);
        }


        switch (per->state) {
        default:
        case STATE_IDLE:
                per->stop = true;
                finish();
                break;

        case STATE_START: {
                if (i2c->SR1 & I2C_SR1_SB) {
                        GPIO_SET_PIN(TP224); // TEST

                        if (per->dev->config->addr10bit) {
                                if (per->addr10rd) {
                                        per->state    = STATE_ADDRESS_SENT;
                                        per->addr10rd = false;
                                } else {
                                        per->state = STATE_ADDRESS_HEADER_SENT;
                                }

                                i2c->DR = header10b | ((per->dev->address & 0x300) >> 7) | (per->addr10rd ? 1 : 0);

                        } else {
                                per->state = STATE_ADDRESS_SENT;
                                if (per->write) {
                                        i2c->DR = per->dev->address & 0xFE;
                                } else {
                                        if (per->data_size > 1) {
                                                SET_BIT(i2c->CR1, I2C_CR1_ACK);
                                        } else {
                                                CLEAR_BIT(i2c->CR1, I2C_CR1_ACK);
                                        }

                                        i2c->DR = per->dev->address | 0x01;
                                }
                        }

                        GPIO_CLEAR_PIN(TP224); // TEST
                } else if (i2c->SR1 & I2C_SR1_BTF) {
                        // IRQ caught when repeated-start is generated after transmit sequence
                        // this operation prevents function from continuously IRQ
                        // generation at repeated start sequence
                        u8_t tmp = i2c->DR;
                        (void)tmp;
                } else {
                        error();
                }
                break;
        }

        case STATE_ADDRESS_HEADER_SENT:
                if (i2c->SR1 & I2C_SR1_ADD10) {
                        per->state    = STATE_ADDRESS_SENT;
                        per->addr10rd = !per->write;
                        i2c->DR       = per->dev->address;

                } else {
                        error();
                }
                break;

        case STATE_ADDRESS_SENT:
                if (i2c->SR1 & I2C_SR1_ADDR) {
                        GPIO_SET_PIN(TP218); // TEST

                        int tmp = i2c->SR2;
                        (void)tmp;

                        if (per->write) {
                                per->state = STATE_SUB_ADDRESS;
                        } else {
                                if (per->dev->config->addr10bit && per->addr10rd) {
                                        per->state = STATE_START;
                                        SET_BIT(i2c->CR1, I2C_CR1_START);
                                        break;
                                }

                                if (per->data_size == 1) {
                                        SET_BIT(i2c->CR1, I2C_CR1_STOP);
                                }

                                per->state = STATE_TRANSFER;
                        }

